################################################################################
# SPDX-FileCopyrightText: Copyright (c) 2023 NVIDIA CORPORATION & AFFILIATES. All rights reserved.
# SPDX-License-Identifier: MIT
#
# Permission is hereby granted, free of charge, to any person obtaining a
# copy of this software and associated documentation files (the "Software"),
# to deal in the Software without restriction, including without limitation
# the rights to use, copy, modify, merge, publish, distribute, sublicense,
# and/or sell copies of the Software, and to permit persons to whom the
# Software is furnished to do so, subject to the following conditions:
#
# The above copyright notice and this permission notice shall be included in
# all copies or substantial portions of the Software.
#
# THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
# IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
# FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
# THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
# LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
# FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
# DEALINGS IN THE SOFTWARE.
################################################################################

name: "triton_custom_backend_ensemble"
platform: "ensemble"
max_batch_size: 16
input [
  {
    name: "OBJECT"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [3, 224, 224]
  },
  {
    name: "STREAM_ID"
    data_type: TYPE_INT32
    dims: [1]
  }
]
output [
  {
    name: "CAR_COLOR"
    data_type: TYPE_FP32
    dims: [12, 1, 1]
  },
  {
    name: "CAR_MAKE"
    data_type: TYPE_FP32
    dims: [20, 1, 1]
  },
  {
    name: "VEHICLE_TYPE"
    data_type: TYPE_FP32
    dims: [6, 1, 1]
  },
  {
    name: "INFERENCE_COUNT"
    data_type: TYPE_INT32
    dims: [1]
  }

]
ensemble_scheduling {
  step [
    {
      model_name: "deepstream_triton_custom_cpp_backend"
      model_version: 1
      input_map {
        key: "INPUT"
        value: "STREAM_ID"
      }
      output_map {
    key: "OUTPUT"
        value: "INFERENCE_COUNT"
      }
    },
    {
      model_name: "Secondary_CarColor"
      model_version: 1
      input_map {
        key: "input_1"
        value: "OBJECT"
      }
      output_map {
        key: "predictions/Softmax"
        value: "CAR_COLOR"
      }
    },
    {
      model_name: "Secondary_CarMake"
      model_version: 1
      input_map {
        key: "input_1"
        value: "OBJECT"
      }
      output_map {
        key: "predictions/Softmax"
        value: "CAR_MAKE"
      }
    },
    {
      model_name: "Secondary_VehicleTypes"
      model_version: 1
      input_map {
        key: "input_1"
        value: "OBJECT"
      }
      output_map {
        key: "predictions/Softmax"
        value: "VEHICLE_TYPE"
      }
    }
  ]
}
